app/Http/Controllers/LibroController.php

select * from `libros` where `titulo` like '%%' and `sinopsis` like '%%' and `pvp` between 20 and 50 order by `id` asc limit 5 offset 0
select count(*) as aggregate from `libros` where `titulo` like '%%' and `sinopsis` like '%%' and `pvp` between 20 and 50
---
    public function index(Request $request)
    {
        $titulo=$request->get('titulo');
        $sinopsis=$request->get('sinopsis');
        $pvp=$request->get('pvp');
        $libros=Libro::orderBy('id')
        ->titulo($titulo)
        ->sinopsis($sinopsis)
        ->select($pvp)
        ->paginate(5);

select * from `libros` order by `id` asc limit 5 offset 0
select count(*) as aggregate from `libros`
---
    public function mostrarTodos(){
        //$libros=Libro::all()
        $libros=Libro::orderBy("id")->paginate(5);